{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: replacing city dropdowns with Google Maps Places Autocomplete inputs in both the HeroSection booking form and the BookingModal Step 1.",
  "frontend-file-summaries.txt": "JSON map of frontend component file paths to short descriptions summarizing each component's purpose and key UI elements.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH design token CSS custom properties for light and dark themes, plus base body and border resets.",
  "frontend/index.html": "HTML entry point for the Khanswheel app including SEO meta tags, Google Fonts/Font Awesome CDN links, structured data JSON-LD, and the Google Maps Places API script tag with a placeholder API key.",
  "frontend/src/App.tsx": "Root React component that simply renders the KhanswheelApp page component.",
  "frontend/src/components/khanswheel/AboutSection.tsx": "About Us section rendering the company story, mission/vision cards, key statistics, and a three-person team grid on a dark navy background with a mandala pattern overlay.",
  "frontend/src/components/khanswheel/BlogSection.tsx": "Blog section displaying three hardcoded travel-tip article cards with gradient thumbnails, category badges, read-time, and hover lift animations on a light grey background.",
  "frontend/src/components/khanswheel/BookingModal.tsx": "Full-screen 5-step booking modal that uses PlacesAutocomplete inputs for pickup and drop locations in Step 1, followed by vehicle selection, add-ons, personal details, and payment steps with validation and a confirmation screen.",
  "frontend/src/components/khanswheel/CompareBar.tsx": "Renders a sticky bottom bar showing selected vehicles (up to 3) for comparison, and a modal dialog that displays a side-by-side attribute comparison table for those vehicles.",
  "frontend/src/components/khanswheel/ContactSection.tsx": "Displays a contact form section with name, phone, email, and message fields, including client-side validation and a success confirmation state after submission.",
  "frontend/src/components/khanswheel/CookieBanner.tsx": "Shows a fixed bottom cookie consent banner that persists the user's accept or decline choice to localStorage and hides itself accordingly.",
  "frontend/src/components/khanswheel/CoverageMap.tsx": "Renders an SVG map of India with interactive city pins that display a tooltip showing the city name and available car count on hover.",
  "frontend/src/components/khanswheel/FleetSection.tsx": "Displays a filterable grid of vehicle cards by category, with each card supporting book-now and add-to-compare actions.",
  "frontend/src/components/khanswheel/FloatingElements.tsx": "Provides fixed floating UI elements including a WhatsApp chat button, a scroll-to-top button (visible after scrolling 300px), and a live chat button.",
  "frontend/src/components/khanswheel/Footer.tsx": "Renders the site footer with brand info, social media links, a newsletter email input, quick link columns, and a copyright bar for the Khanswheel car rental site.",
  "frontend/src/components/khanswheel/Header.tsx": "Fixed navigation header that turns opaque on scroll, containing the logo, desktop nav links with smooth-scroll, a phone number, WhatsApp link, and a Book Now button, plus a mobile hamburger menu.",
  "frontend/src/components/khanswheel/HeroSection.tsx": "Full-viewport hero section with a background image overlay, headline copy, and an inline booking form supporting one-way, round-trip, and hourly trip types with pickup/drop autocomplete and date inputs.",
  "frontend/src/components/khanswheel/HowItWorks.tsx": "Displays a four-step booking process (Choose Car → Location & Date → Pay → Ride) as a horizontal stepper with icons, numbered badges, and dashed connectors that stack vertically on mobile.",
  "frontend/src/components/khanswheel/OffersSection.tsx": "Renders a grid of five promotional offer cards (weekend, corporate, honeymoon, airport, outstation) with gradient backgrounds, badge labels, and live countdown timers for time-limited deals.",
  "frontend/src/components/khanswheel/PlacesAutocomplete.tsx": "A React component that provides a location input with Google Maps Places autocomplete suggestions, supporting keyboard navigation, debounced fetching, and outside-click dismissal.",
  "frontend/src/components/khanswheel/ReviewsSection.tsx": "Displays a customer reviews section with an auto-scrolling carousel of review cards and a rating breakdown summary with star ratings.",
  "frontend/src/components/khanswheel/StatsSection.tsx": "Renders an animated statistics section that counts up numbers (cars, cities, customers, rating) when scrolled into view using an IntersectionObserver.",
  "frontend/src/components/khanswheel/TrustSignals.tsx": "Displays trust-building elements including a secure payment badge, fleet partner brand logos, and certification badges (ISO, RTO, GST).",
  "frontend/src/components/khanswheel/WhyChooseUs.tsx": "Renders a 'Why Choose Us' feature grid with six animated cards highlighting Khanswheel's key differentiators, revealed on scroll via IntersectionObserver.",
  "frontend/src/data/vehicles.ts": "Defines the Vehicle TypeScript interface and exports a static array of eight rental vehicle listings with details like pricing, seats, fuel type, and category.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient configuration.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with CSS custom properties for light/dark theming, custom scrollbar styles, fonts, and a fade-in animation utility.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/KhanswheelApp.tsx": "Main page component for the Khanswheel car rental app, composing all landing page sections and managing booking modal, vehicle comparison, and smooth-scroll behavior.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining OKLCH-based design tokens, custom border radii, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing the Khanswheel car rental website's architecture, color scheme, implemented features, and pending feature requests."
}